/* Copyright © 2001-2012 Apple Inc. All Rights Reserved. */
/* Localization dictionary for Apple Hardware Test 3.0 series */

"is-two-bytes"	= "1";
"version-sig"	= "EN-070918";

"common-controls-restart"		= "إعادة التشغيل";
"common-controls-shutdown"		= "إيقاف التشغيل";
"common-controls-continue"		= "متابعة";

"common-tab-apple-title"		= " حول ";			// does look better with spaces at head and tail
"common-tab-test-title"			= " اختبارات الأجهزة";	// does look better with spaces at head and tail
"common-tab-profile-title"		= " ملف تعريف الأجهزة";	// does look better with spaces at head and tail
"common-version-str"			= "الإصدار ";
"common-bundle-str"				= "الحزمة ";

"mark-graphics-unknown-str"		= "فيديو غير معروف";
"mark-graphics-none-str"		= " ";

"mark-generic-present-str"		= "مثبت";
"mark-generic-absent-str"		= "لم يتم العثور عليه";
"mark-generic-hasDevice-str"	= "الجهاز متصل";
"mark-generic-hasNoDevice-str"	= "لا يوجد جهاز متصل";

"units-hz--short-str"	= "هرتز";
"units-hz--long-str"	= "هرتز";
"units-byte-short-str"	= "بايت";
"units-byte-long-str"	= "بايت";
"units-bit-short-str"	= "b";
"units-bit-long-str"	= "بت";
"units-volt-short-str"	= "فولت";
"units-volt-long-str"	= "فولت";


"units-hour-str"		= " ساعة ";
"units-hours-str"		= " ساعات";
"units-min-str"			= " دقيقة ";
"units-mins-str"		= " دقيقة ";
"units-sec-str"			= " ثانية";
"units-secs-str"		= " ثوانٍ";

"units-kilo-str"		= "كيلوبايت";
"units-mega-str"		= "ميغابايت";
"units-giga-str"		= "G";
"units-tera-str"		= "تيرابايت";

"delim-date-str"		= "/";
"delim-at-str"			= " @ ";
"delim-record-str"		= ":";
"delim-field-str"		= "‏، ";
"delim-item-str"		= "-";
"delim-decimal-str"		= ".";
"delim-thousds-str"		= "‏، ";
"delim-space-str"		= " ";
"delim-pct-str"			= "٪";

"notcompat-nosupport-str"		= "لا يدعم Apple Hardware Test هذا الجهاز.";
"notcompat-ownrisk-str"			= "المتابعة على مسؤوليتك الشخصية [الإصدار المسبق فقط].";


"test-head-intro1-text"			= "بإمكان Apple Hardware Test إجراء اختبار على الأجهزة لـ Macintosh الخاص بك.";
"test-head-intro2-text"			= "لإجراء الاختبارات، انقر على الزر \"اختبار\" أو اضغط على المفتاح \"T\".";

"test-probe-onto-text"			= "فحص الأجهزة الخاصة بك؛ قد يستغرق هذا الأمر دقيقة...";
"test-probe-outof-text"			= "اكتمل فحص الأجهزة.";

"test-controls-launch"			= "اختبار";
"test-controls-interrupt"		= "إيقاف الاختبار";

"test-choices-title"			= "خيارات الاختبار";
"test-about-title"				= "حول الاختبارات والنتائج";
"test-results-title"			= "نتائج الاختبار";

"test-results-notestyet"		= "لا يمكن إجراء أي اختبار حتى اكتمال الفحص.";
"test-results-nodevfound"		= "لم يتم العثور على أي أجهزة.";
"test-results-notyet"			= "جاهز للاختبار.";
"test-results-quick-ongoing"	= "اختبار قيد التقدم.";
"test-results-extend-ongoing"	= "اختبار موسع قيد التقدم.";
"test-results-willstop"			= "سيتوقف الاختبار.";
"test-results-interrupted"		= "لم يكتمل الاختبار.";
"test-results-nofail"			= "لم يتم العثور على أي مشاكل.";
"test-results-error"			= "خطأ داخلي أثناء الاختبار.";
"test-results-failed"			= "تنبيه!  اكتشف Apple Hardware Test وجود خطأ.";

"test-ongoing-short-status"		= "اختبار قيد التقدم.";
"test-ongoing-mlb-status"		= "اختبار اللوحة الأم الرئيسية.";
"test-ongoing-memory-status"	= "اختبار الذاكرة.";
"test-ongoing-storage-status"	= "اختبار التخزين.";
"test-ongoing-video-status"		= "اختبار الرسومات.";

"test-ongoing-pass-time-text"	= " إلى الاختبار...";
"test-ongoing-pass-time-1-text"	= " ";
"test-ongoing-pass-time-2-text"	= "إلى الاختبار...";
"test-ongoing-sess-pass-text"	= "رقم المرور: ";
"test-ongoing-sess-time-text"	= "إجمالي وقت الاختبار:";

"test-desc-initial-1-text"	= "يعد Apple Hardware Test أداة تشخيص للكشف عن المشاكل في مكونات الكمبيوتر الخاص بك.";
"test-desc-initial-2-text"	= " ";
"test-desc-initial-3-text"	= "ستساعد الاختبارات التي تم تنفيذها في تحديد ما إذا كان لديك مشاكل في الأجهزة أو البرامج.";
"test-desc-initial-4-text"	= " ";
"test-desc-initial-5-text"	= "إذا أوضحت نتائج الاختبار عدم وجود مشكلة في الأجهزة، فراجع الدليل و/أو (نظام) المساعدة المتوفرة مع الكمبيوتر لمزيد من استكشاف المشاكل وإصلاحها.";
"test-desc-initial-6-text"	= " ";

"test-desc-intro-quick-text"	= "الوقت المقدر للاكتمال: ٣ دقائق أو أكثر، وفقًا إلى كمية الذاكرة المثبتة.";	/* default */
"test-desc-intro-quick-text2"	= "الوقت المقدر للاكتمال: ١٠ إلى ١٥ ثانية أو أكثر، وفقًا إلى كمية الذاكرة المثبتة.";
"test-desc-intro-quick-text3"	= "الوقت المقدر للاكتمال: دقيقتين أو أكثر، وفقًا إلى كمية الذاكرة المثبتة.";
"test-desc-intro-quick-text4"	= "الوقت المقدر للاكتمال: ٤ دقائق أو أكثر، وفقًا إلى كمية الذاكرة المثبتة.";

"test-desc-intro-extend-text"	= "الوقت المقدر للاكتمال: ساعة واحدة أو أكثر، وفقًا إلى كمية الذاكرة المثبتة.";	/* default */
"test-desc-intro-extend-text2"	= "الوقت المقدر للاكتمال: ١٠ إلى ١٥ دقيقة أو أكثر، وفقًا إلى كمية الذاكرة المثبتة.";
"test-desc-intro-extend-text3"	= "الوقت المقدر للاكتمال: ٣٠ دقيقة أو أكثر، وفقًا إلى كمية الذاكرة المثبتة.";
"test-desc-intro-extend-text4"	= "الوقت المقدر للاكتمال: ساعتين أو أكثر، وفقًا إلى كمية الذاكرة المثبتة.";

"test-desc-option-extend-text"	= "إجراء اختبار موسع (يستغرق وقتًا أطول بكثير).";
"test-desc-option-loop-text"	= "تمكين التكرار.";

"test-desc-quick-running-1-text"	= "اختبار قيد التقدم...";
"test-desc-quick-running-2-text"	= "للتوقف، اضغط على المفتاح \"إيقاف الاختبار\".";
"test-desc-quick-running-3-text"	= "أو، اضغط على مفتاح \"الأوامر\" (\"Apple\") والمفتاح \".\" (نقطة) في نفس الوقت.";
"test-desc-quick-running-4-text"	= " ";

"test-desc-extend-running-1-text"	= "اختبار موسع قيد التقدم...";
"test-desc-extend-running-2-text"	= "للتوقف، اضغط على المفتاح \"إيقاف الاختبار\".";
"test-desc-extend-running-3-text"	= "أو، اضغط على مفتاح \"الأوامر\" (\"Apple\") والمفتاح \".\" (نقطة) في نفس الوقت.";
"test-desc-extend-running-4-text"	= " ";

/* About the Tests and Results Test tests failed */
"test-result-testing-1-text"		= "تنبيه!  اكتشف Apple Hardware Test وجود خطأ.";
"test-result-testing-2-text"		= " ";
"test-result-testing-3-text"		= "أولًا، سجل ملاحظة برمز الخطأ في منطقة نتائج الاختبارات.";
"test-result-testing-4-text"		= " ";
"test-result-testing-5-text"		= "ثانيًا، إذا كان هنالك أي أجهزة طرفية مرفقة بالكمبيوتر، فالرجاء إيقاف تشغيل الكمبيوتر واقطع اتصال الأجهزة الطرفية وقم بتشغيل الاختبار الموسع للتحقق من النتائج.";
"test-result-testing-6-text"		= " ";
"test-result-testing-7-text"		= "بعد ذلك، إذا كان لا يزال يتم الإبلاغ عن خطأ، فراجع مواد الخدمة والدعم المرافقة للكمبيوتر للحصول على إرشادات حول الاتصال بـ AppleCare لمزيد من المساعدة.";
"test-result-testing-8-text"		= " ";

/* About the Tests and Results Test POST failed */
"test-result-startup-1-text"		= "تنبيه!  اكتشف Apple Hardware Test وجود خطأ في بدء التشغيل.";
"test-result-startup-2-text"		= " ";
"test-result-startup-3-text"		= "أولًا، سجل ملاحظة برموز الأخطاء في منطقة نتائج الاختبارات.";
"test-result-startup-4-text"		= " ";
"test-result-startup-5-text"		= "ثانيًا، إذا كان هنالك أي أجهزة طرفية مرفقة بالكمبيوتر، فالرجاء إيقاف تشغيل الكمبيوتر واقطع اتصال الأجهزة الطرفية وقم بتشغيل الاختبار الموسع للتحقق من النتائج.";
"test-result-startup-6-text"		= " ";
"test-result-startup-7-text"		= "بعد ذلك، إذا كان لا يزال يتم الإبلاغ عن خطأ، فراجع مواد الخدمة والدعم المرافقة للكمبيوتر للحصول على إرشادات حول الاتصال بـ AppleCare لمزيد من المساعدة.";
"test-result-startup-8-text"		= " ";
"test-result-startup-9-text"		= " ";
"test-result-startup-10-text"		= " ";
"test-result-startup-11-text"		= " ";


/* HW-Profile values */

"prof-prod-group-title"			= "المنتج";
"prof-prod-group-subtitle"		= "تفاصيل المنتج:";
"prof-prod-name-label"			= "اسم Macintosh:";
"prof-prod-model-label"			= "طراز Macintosh:";
"prof-prod-cputype-label"		= "نوع وحدة المعالجة المركزية:";
"prof-prod-cpucount-label"		= "عدد المعالجات:";
"prof-prod-cpucoretotal-label"	= "إجمالي عدد المراكز:";
"prof-prod-cpucorecount-label"	= "عدد المراكز:";
"prof-prod-cpuspeed-label"		= "سرعة وحدة المعالجة المركزية:";
"prof-prod-cpucache-label"		= "ذاكرة وحدة المعالجة المركزية المؤقتة L2 (لكل معالج):";

"prof-prod-L2cache-label"		= "الذاكرة المؤقتة L2:";
"prof-prod-L2cachecore-label"	= "الذاكرة المؤقتة L2 (لكل مركز):";
"prof-prod-L3cache-label"		= "الذاكرة المؤقتة L3:";

"prof-prod-cpucache3-label"		= "الذاكرة المؤقتة L3 (لكل وحدة معالجة مركزية):";
"prof-prod-mlb-sn-label"		= "الرقم التسلسلسي لـ MLB:";
"prof-processor-tray-sn-label"	= "الرقم التسلسلي لعلبة المعالج:";

"prof-graph-group-title"		= "الفيديو";
"prof-graph-group-subtitle"		= "تفاصيل الفيديو:";
"prof-graph-chipset-label"		= "الرسومات:";
"prof-graph-vram-label"			= "VRAM:";
"prof-graph-disp-width-label"	= "عرض العرض (بالبكسل):";
"prof-graph-disp-height-label"	= "ارتفاع العرض (بالبكسل):";

"prof-communi-group-title"		= "الاتصال";
"prof-communi-group-subtitle"	= "تفاصيل الاتصال:";
"prof-communi-enet-mac-label"	= "عنوان MAC لإيثرنت:";
"prof-communi-fwire-mac-label"	= "عنوان MAC لـ FireWire:";
"prof-communi-airp-type-label"	= "AirPort:";
"prof-communi-bluetooth-label"	= "Bluetooth:";
"prof-communi-irport-label"		= "مستقبل الأشعة تحت الحمراء:";
"prof-communi-usb1-connect-label"	= "منفذ USB ١:";
"prof-communi-usb2-connect-label"	= "منفذ USB ٢:";
"prof-communi-usb3-connect-label"	= "منفذ USB ٣:";
"prof-communi-usb4-connect-label"	= "منفذ USB ٤:";

"prof-memo-group-title"			= "الذاكرة";
"prof-memo-group-subtitle"		= "تفاصيل الذاكرة:";
"prof-memo-overview-label"		= "عرض عام";
"prof-memo-slot-1-label"		= "الذاكرة #١";
"prof-memo-slot-2-label"		= "الذاكرة #٢";
"prof-memo-slot-3-label"		= "الذاكرة #٣";
"prof-memo-slot-4-label"		= "الذاكرة #٤";
"prof-memo-slot-5-label"		= "الذاكرة #٥";
"prof-memo-slot-6-label"		= "الذاكرة #٦";
"prof-memo-slot-7-label"		= "الذاكرة #٧";
"prof-memo-slot-8-label"		= "الذاكرة #٨";

"prof-memo-type-str"			= "‏SDRAM ملحوم في MLB.";
"prof-memo--str"				= "غير معروف";
"prof-memo-pc2-3700-str"		= "PC2-3700";
"prof-memo-pc2-4000-str"		= "PC2-4000";
"prof-memo-pc2-4200-str"		= "PC2-4200";
"prof-memo-pc2-4800-str"		= "PC2-4800";
"prof-memo-ddr2-str"			= "DDR2 SDRAM";
"prof-memo-fbdimm-str"			= "FBDIMM";
"prof-memo-cl-str"				= "CL";
"prof-memo-ct1-str"				= "وقت الدورة (ns)";
"prof-memo-ct2-str"				= " دورة (ns)";
"prof-memo-ct3-str"				= " (ns)";
"prof-memo-rev-str"				= "Rev.";
"prof-memo-paired-str"			= "الإقران مع #";
"prof-memo-paired-not-str"		= " غير مقترن";
"prof-memo-mismatch-label"		= "عدم تطابق:";
"prof-memo-size-str"			= " الحجم";
"prof-memo-speed-str"			= " السرعة";
"prof-memo-vendor-str"			= " البائع";
"prof-memo-recommend-str"		= "موصى به: ";
"prof-memo-post-fail-str"		= "فشل POST";

"prof-board-group-title"		= "اللوحة الأم";
"prof-board-brom-vers-label"	= "إصدار‫ ROM للتمهيد:";
"prof-board-smc-vers-label"		= "إصدار SMC:";
"prof-board-syst-sn-label"		= "الرقم التسلسلي للنظام:";
"prof-board-bootdev-label"		= "جهاز التمهيد الافتراضي:";

"prof-stor-group-title"			= "التخزين";
"prof-stor-size-label"			= "الحجم:";

"prof-powr-group-title"			= "الطاقة";
"prof-powr-group-subtitle"		= "تفاصيل الطاقة:";
"prof-powr-src-label"			= "مصدر الطاقة:";
"prof-powr-src-wall-str"		= "المحوّل";
"prof-powr-src-batt-str"		= "البطارية";
"prof-powr-ac-on-str"			= "متصل";
"prof-powr-ac-off-str"			= "غير متصل";
"prof-powr-capac-label"			= "السعة:";
"prof-powr-volt-label"			= "الجهد الكهربي:";
"prof-powr-status-label"		= "الحالة:";

